app/controllers/notes_controller.rb

  def index
      @notes = Note.all
---
SELECT "notes".* FROM "notes"

   def create
      @note = Note.new(note_params)

      if @note.save
---
INSERT INTO "notes" ("name", "description", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "mahati"], ["description", "this is for trial"], ["content", "q1.pdf"], ["created_at", 2017-04-09 17:34:08 UTC], ["updated_at", 2017-04-09 17:34:08 UTC]]